artillery/scenarios/smoke-test.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Smoke test"
  defaults:
    headers:
      User-Agent: "Artillery Smoke Test"

scenarios:
  - name: "Smoke Test Scenario"
    flow:
      - get:
          url: "/posts"
          expect:
            - statusCode: 200
      - think: 0.5

      - get:
          url: "/posts/1"
          expect:
            - statusCode: 200
            - hasProperty: title
      - think: 0.5

      - post:
          url: "/posts"
          json:
            title: "Artillery smoke test"
            body: "Testing create endpoint"
            userId: 1
          expect:
            - statusCode: 201
      - think: 0.5

      - get:
          url: "/users"
          expect:
            - statusCode: 200
      - think: 0.5

      - get:
          url: "/todos"
          expect:
            - statusCode: 200